# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2025-03-15 17:20:00 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: design(e), meditation(m) plot(p)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* RPG [1/5]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
  A disappointing attempt at a text-based role-playing game.
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 255 :emphasize t
   #+CAPTION: Clock summary at [2025-03-15 Sa 17:19]
   | Headline                        | Time    |         |      |      |
   |---------------------------------+---------+---------+------+------|
   | *Total time*                    | *10:52* |         |      |      |
   |---------------------------------+---------+---------+------+------|
   | *RPG [1/5]*                     | *10:52* |         |      |      |
   | \_  /Components [1/5]/          |         | /10:52/ |      |      |
   | \_    Engine [0/3]              |         |         | 5:35 |      |
   | \_      Mechanics [0/2]         |         |         |      | 3:50 |
   | \_    UI [1/2]                  |         |         | 5:17 |      |
   | \_      Prompt                  |         |         |      | 2:07 |
   | \_      Create character, world |         |         |      | 2:36 |
   #+END:
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Components [1/5]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Engine [0/3]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-03-14 Fr 16:35]--[2025-03-14 Fr 18:10] =>  1:35
    CLOCK: [2025-03-13 Do 18:21]--[2025-03-13 Do 18:31] =>  0:10
    :END:
**** Storage
     I am going to need to store both the world(s) and the state of a running
     game.
     As I am feeling lazy, I think I'll use something like JSON or pickle. If
     I find that to be inconvenient, I will reconsider.
**** TODO Mechanics [0/2]
     :PROPERTIES:
     :COOKIE_DATA: todo recursive
     :VISIBILITY: children
     :END:
     :LOGBOOK:
     CLOCK: [2025-03-14 Fr 13:05]--[2025-03-14 Fr 13:43] =>  0:38
     CLOCK: [2025-03-14 Fr 12:25]--[2025-03-14 Fr 13:00] =>  0:35
     CLOCK: [2025-03-13 Do 19:53]--[2025-03-13 Do 21:28] =>  1:35
     CLOCK: [2025-03-13 Do 18:42]--[2025-03-13 Do 19:33] =>  0:51
     CLOCK: [2025-03-13 Do 18:31]--[2025-03-13 Do 18:42] =>  0:11
     :END:
     This is going to be tricky. At least for me, because I have never done
     anything like this before. So there will be a lot of trial and error
     initially.
***** TODO Fight the Power! [0/0]                                     :feature:
      :PROPERTIES:
      :COOKIE_DATA: todo recursive
      :VISIBILITY: children
      :END:
      I want to make the fighting system less tedious.
      - [ ] Allow player to flee (or attempt to)
      - [ ] Monster might flee?
      - [ ] When slain, monster drop items!
      - [ ] More options, e.g. focus on defense vs attack?
      - [ ] I might make a separate sub Shell for this?
***** TODO Talk to me! [0/0]
      :PROPERTIES:
      :COOKIE_DATA: todo recursive
      :VISIBILITY: children
      :END:
      Would be nice if one could talk to characters. I am thinking of a
      dialogue tree as in Shadowrun. But that's going to be a challenge.
      I found a library, [[file:///usr/share/doc/packages/python313-prompt_toolkit/README.rst][prompt_toolkit]], that seems like a great fit.
*** UI [1/2]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-03-14 Fr 14:50]--[2025-03-14 Fr 15:24] =>  0:34
    :END:
**** DONE Prompt
     CLOSED: [2025-03-15 Sa 17:19]
     :LOGBOOK:
     CLOCK: [2025-03-15 Sa 17:13]--[2025-03-15 Sa 17:19] =>  0:06
     CLOCK: [2025-03-15 Sa 15:06]--[2025-03-15 Sa 17:06] =>  2:00
     CLOCK: [2025-03-15 Sa 10:31]--[2025-03-15 Sa 10:32] =>  0:01
     :END:
     I discovered prompt_toolkit, which so far is great.
**** TODO Create character, world
     :LOGBOOK:
     CLOCK: [2025-03-13 Do 21:51]--[2025-03-14 Fr 00:25] =>  2:34
     CLOCK: [2025-03-13 Do 21:28]--[2025-03-13 Do 21:30] =>  0:02
     :END:
     In order to do some testing, I will need to create a player character and
     a world.
     Creating the world should be automatic, creating the player interactive.
** World building [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Plot [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Ace of Spades
    The player is an intern at the royal court and is given the mission to
    find out why strange things have been going on in the realm lately.
    The Great Oracle, for example, has been giving weird answers ("maybe" for
    yes-and-no questions, "idk lmao" for others). Magic has been
    malfunctioning, but other things, too.
    Turns out, the kingdom's Random Number Generator is broken.
    There are several ways to make the realm random again:
    - collect entropy and infuse the RNG with it
    - steal an RNG from another kingdom or a dragon
    - create a new RNG that is even more random than the old one ever was.
